carrierCybertruck/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-100 -10 -0.860503)
    (20 -10 -0.860503)
    (20 0 -0.860503)
    (-100 0 -0.860503)
    (-100 -10 20)
    (20 -10 20)
    (20 0 20)
    (-100 0 20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 20 42) simpleGrading (1 1 1)
);

boundary
(
    tarmac
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    upperArea
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (6 5 1 2)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    lateralArea
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    symmetryPlane
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
);

// ************************************************************************* //
