carrierCybertruck/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
	"bodyCassoneChiusoPortapacchi_mm.stl"
	"FR_mm.stl"
	"RR_mm.stl"
);

// Identify a feature when angle between faces < includedAngle
includedAngle   120;

// Do not mark region edges
geometricTestOnly       yes;

// Write options

// Write features to obj format for postprocessing
writeObj                yes;
verboseObj              no;
